module.exports.config = {
    name: "\n",
    version: "1.0.0",
    hasPermssion: 0,
    credits: "CYBER ☢️_𖣘 -𝐁𝐎𝐓",
    description: "Random Islamic Text Post",
    commandCategory: "poster",
    usages: "islam",
    cooldowns: 5
};

module.exports.run = async ({ api, event }) => {                      
    const captions = [
        "🤲💭 🕋\nমনে রাখবেন: ইসলাম বিজয়ী হবেই হবে। আপনাকে সহ কিংবা আপনাকে ছাড়া। কিন্তু আপনি বিজয়ী হতে পারবেন না, ইসলামকে ছাড়া।✨✨✨",
        "°°°﷽\nআলহামদুলিল্লাহ! আমরা কতই না ভাগ্যবান, ইসলাম আমাদের ধর্ম এবং ইতিহাসে শ্রেষ্ঠ নবীর উম্মত আমরা।",
        "🕋🕋🕋🕋\nকখনোই বান্দাকে আল্লাহ বঞ্চিত করেন না। হয়তো আপনি যা চান, সেটায় আপনার কল্যাণ নেই, তাই আল্লাহ আপনাকে দেন নাই।🤲💭 🕋 🖤🥀",
        "✿•Best Line❥•\nইসলাম বলে, বিশ্ব ভ্রাতৃত্বের কথা, এমন এক পৃথিবী যেখানে সকল দেশের সকল বর্ণের মানুষ একে অপরের ভাই ভাই।",
        "♡Alhamdulillah♡\nপ্রকৃত ঈমানদারের হাত ও মুখ থেকে সবাই নিরাপদ।",
        "😌💔\nআমরা মানুষ কতই না বোকা, দুনিয়ার লাভের আশায় পরকালের সুখ থেকে বঞ্চিত হই।",
        "〇ლ__♥❤💙💙\nহে নারী সাবধান, ইন্টারনেটে তোমাকে শিকারের শিখারীর অভাব নেই।",
        "🕌🕌🕌🕌🕌\nআমরা অনিশ্চিত ভবিষ্যৎ নিয়ে যতটা চিন্তিত কিন্তু নিশ্চিত মৃত্যু নিয়ে ততটা চিন্তা করি না।",
        "🌿🦋🍁\nযে মানুষ মানুষের মাঝে বিভেদ সৃষ্টি করে, সে আর যাই হোক, মুসলিম নয়।",
        "⌓In sha Allah⌓ \nকিসের তোষক আর এসি রুম। এই দুনিয়ার সর্বাপেক্ষা শান্তির জায়গা হলো, আল্লাহর ঘর মসজিদ।",
        "🌸Alhamdulillah🌸\nসাধারণ জীবনেও ইসলামী নীতি মেনে চলো। ছোট ছোট কাজের মধ্যেও আল্লাহর সন্তুষ্টি লাভের চেষ্টা করো।"
    ];

    const randomCaption = captions[Math.floor(Math.random() * captions.length)];
    return api.sendMessage(randomCaption, event.threadID);
};
